Revit 2026 API

# ItemFactoryBaseNewDimension(View, Line, ReferenceArray) Method

---

Creates a new linear dimension object using the default dimension style.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Dimension NewDimension(
	View view,
	Line line,
	ReferenceArray references
)
```
```vb
Public Function NewDimension (
	view As View,
	line As Line,
	references As ReferenceArray
) As Dimension
```
```cpp
public:
Dimension^ NewDimension(
	View^ view,
	Line^ line,
	ReferenceArray^ references
)
```
```fsharp
member NewDimension :
        view : View *
        line : Line *
        references : ReferenceArray -> Dimension
```

#### Parameters

view View
     The view in which the dimension is to be visible. The view must be  if the document is in [!:Autodesk::Revit::DB::SketchEditScope].
line Line
     The line drawn for the dimension.
references ReferenceArray
     An array of geometric references to which the dimension is to be bound.

#### Return Value

Dimension If successful a new dimension object, otherwise .

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when references are not geometric references. |

The currently user set default style is used for the created dimension.

#### Reference

ItemFactoryBase Class

NewDimension Overload

Autodesk.Revit.Creation Namespace